InformationRegisters/ГрафикАдминистративныхМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГрафикАдминистративныхМероприятий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдминистративныеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПродолжительностьМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПродолжительностьМероприятий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдминистративныеМероприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ВетеринарныеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ГрафикАдминистративныхМероприятий/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьГрафикАдминистративныхСобытий();
	
	// Настроить планировщик.
	Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Час;
	Планировщик.КратностьПериодическогоВарианта = 24;
	
	Планировщик.ОтступСНачалаПереносаШкалыВремени = 8; // планер с 8:00
	Планировщик.ОтступСКонцаПереносаШкалыВремени = 2; // планер до 22:00 
	
	Планировщик.ВыравниватьГраницыЭлементовПоШкалеВремени = Истина;
	Планировщик.ОтображатьТекущуюДату = Истина;
	
	Планировщик.ФорматПеренесенныхЗаголовковШкалыВремени = "ДФ='дддд, д ММММ гггг'";
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериода = КонецНедели(ТекущаяДатаСеанса());
	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрафикАдминистративныхСобытий()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикАдминистративныхМероприятий.Мероприятие.Представление КАК Мероприятие,
		|	ГрафикАдминистративныхМероприятий.ДатаНачала КАК ДатаНачала,
		|	ГрафикАдминистративныхМероприятий.Регистратор КАК Регистратор,
		|	ЕСТЬNULL(ПродолжительностьМероприятий.Продолжительность, ДАТАВРЕМЯ(1, 1, 1, 0, 10, 0)) КАК Продолжительность
		|ИЗ
		|	РегистрСведений.ГрафикАдминистративныхМероприятий КАК ГрафикАдминистративныхМероприятий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПродолжительностьМероприятий КАК ПродолжительностьМероприятий
		|		ПО ГрафикАдминистративныхМероприятий.Мероприятие = ПродолжительностьМероприятий.Мероприятие
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДатаОкончания = Выборка.ДатаНачала + (Выборка.Продолжительность - Дата(1,1,1));
		НовоеМероприятие          = Планировщик.Элементы.Добавить(Выборка.ДатаНачала, ДатаОкончания);
		НовоеМероприятие.Текст    = Выборка.Мероприятие;
		НовоеМероприятие.Значение = Выборка.Регистратор;
		
		Если Выборка.ДатаНачала >= ТекущаяДатаСеанса() Тогда
			НовоеМероприятие.ЦветФона = WebЦвета.БледноЗеленый; // текущие и будущие события
		Иначе
			НовоеМероприятие.ЦветФона = WebЦвета.Роса; // прошедшие мероприятия
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НовыйПериод = ТекущиеПериодыОтображения[0];
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	
	НачалоПериода = НачалоНедели(НовыйПериод.Конец);
	КонецПериода = КонецНедели(НовыйПериод.Конец);
	
	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикВыбор(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РегистраторСобытия = Элемент.ВыделенныеЭлементы[0].Значение; 
	
	ОткрытьЗначение(РегистраторСобытия);
	
КонецПроцедуры
